Config/Reports/СравнительныйАнализОборотовПоСтатьям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СравнительныйАнализОборотовПоСтатьям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСценарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДанныхДляОтчетовБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/AccumulationRegisters/ОборотыБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыБюджетов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценария</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиОборотовПоБюджетам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджетов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджетов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджетов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика4</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджетов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика5</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджетов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика6</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджетов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Enums/ВидыДанныхДляОтчетовБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДанныхДляОтчетовБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическиеДанные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Reports/СравнительныйАнализОборотовПоСтатьям/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТаблицаСценарииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Если Отчет.ТаблицаСценарии.Количество() > 1 Тогда
			ТекСтрока = Элементы.ТаблицаСценарии.ТекущиеДанные;
			ТекСтрока.НачалоПериода = Отчет.ТаблицаСценарии[0].НачалоПериода;
			ТекСтрока.КонецПериода = Отчет.ТаблицаСценарии[0].КонецПериода;
		Иначе
			ТекСтрока = Элементы.ТаблицаСценарии.ТекущиеДанные;
			ТекСтрока.НачалоПериода = ПериодОтчета.ДатаНачала;
			ТекСтрока.КонецПериода = ПериодОтчета.ДатаОкончания;
		КонецЕсли;
	Конецесли;
КонецПроцедуры


&НаСервере
Функция СформироватьЗаголовокГруппыПолей(СтрокаТаблицы,Префикс="")
	Ответ = ""+СтрокаТаблицы.ВидДанных;
	Если ЗначениеЗаполнено(Ответ) Тогда
		Ответ = Ответ + Символы.ПС;	
	КонецЕсли;
	
	Ответ = Ответ + Префикс + ПредставлениеПериода(НачалоДня(СтрокаТаблицы.НачалоПериода),КонецДня(СтрокаТаблицы.КонецПериода),"ФП = Истина") + Символы.ПС + ?(ЗначениеЗаполнено(СтрокаТаблицы.Сценарий),"Сценарий: "+СтрокаТаблицы.Сценарий ,"без сценария");	
	Возврат Ответ;
КонецФункции


&НаКлиенте
Функция ПолучитьИмяПараметра(ИсходноеИмя,Номер)
	Возврат ИсходноеИмя + +Формат(Номер,"ЧН=0; ЧГ=");
КонецФункции

&НаСЕрвере
Процедура ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПутьКДанным,Псевдоним)
	Оператор = ОператорВыборка.ВыбираемыеПоля.Добавить(ПутьКДанным);
	Если ЗначениеЗаполнено(Псевдоним) Тогда
		ПакетЗапроса.Колонки[ОператорВыборка.ВыбираемыеПоля.Количество()-1].Псевдоним = Псевдоним;    
	Конецесли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПараметр(ИмяПараметра,ЗначениеПараметра)
	НовыйПараметр = СтруктураПараметров.Добавить();	
	НовыйПараметр.Ключ = ИмяПараметра;
	НовыйПараметр.Значение = ЗначениеПараметра;
КонецПроцедуры

&НаСервере
Процедура ВставитьЗначениеВСписокЗначений(СписокЗначений,Значение,Представление)
	Если СписокЗначений.НайтиПоЗначению(Значение) = Неопределено Тогда
		СписокЗначений.Добавить(Значение,Представление);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСценарииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ИнициализироватьОтчет();	
КонецПроцедуры

&НаСЕрвере
Процедура ИнициализироватьОтчет()
	СобратьЗапрос();
	СобратьСКД();   
КонецПроцедуры


&НаСервере
Процедура СобратьЗапрос()
	СтруктураПараметров.Очистить();
	СписокРесурсов.Очистить();
	
	СхемаЗапроса = Новый СхемаЗапроса;
	
	ТаблицаСценарии = Отчет.ТаблицаСценарии.Выгрузить();
	КоличествоСтрокАнализа = ТаблицаСценарии.Количество();
	// перебераем строки таблицы сценарием 1-я из которых эталонный , остальные сравнительные периоды
	Для НомерСтроки = 0 По КоличествоСтрокАнализа-1 Цикл
		СтрокаСценария = ТаблицаСценарии[НомерСтроки];
		ПакетЗапроса   = СхемаЗапроса.ПакетЗапросов[0];  // первый пакет запроса помещаем во временную таблицу
		СхемаЗапроса.ПакетЗапросов[0].ТаблицаДляПомещения="ВР_ОБОРОТЫ";
		Если НомерСтроки = 0 Тогда
			ОператорВыборка = ПакетЗапроса.Операторы[НомерСтроки];
		Иначе
			ПакетЗапроса.Операторы.Добавить();
			ОператорВыборка = ПакетЗапроса.Операторы[НомерСтроки];
			ОператорВыборка.ТипОбъединения=ТипОбъединенияСхемыЗапроса.ОбъединитьВсе;
		КонецЕсли;
		
		
		Если НомерСтроки = 0 Тогда
			ПсевдонимТаблицы = "Эталон";
		Иначе
			ПсевдонимТаблицы = "ОборотыБюджетаПериод"+НомерСтроки;
		КонецЕсли;
		ИсточникОбороты = ОператорВыборка.Источники.Добавить("РегистрНакопления.ОборотыБюджетов.Обороты",ПсевдонимТаблицы); // таблица из которой будем выбирать
		// у таблицы оборотов выставим нужные параметры в том порядке в котором они идут  1 нач 2 кон 3 групировка 4 условие
		ИмяПараметра = "НачалоПериода"+?(НомерСтроки=0,"Эталон",НомерСтроки);
		ДобавитьПараметр(ИмяПараметра,СтрокаСценария.НачалоПериода);
		ИсточникОбороты.Источник.Параметры[0].Выражение = Новый ВыражениеСхемыЗапроса("&"+ИмяПараметра+ " {(&"+ИмяПараметра+")}");
		
		ИмяПараметра = "КонецПериода"+?(НомерСтроки=0,"Эталон",НомерСтроки);
		ДобавитьПараметр(ИмяПараметра,СтрокаСценария.КонецПериода);
		ИсточникОбороты.Источник.Параметры[1].Выражение = Новый ВыражениеСхемыЗапроса("&"+ИмяПараметра+ " {(&"+ИмяПараметра+")}"); //{(&НачалоПериода0)}
		
		ИсточникОбороты.Источник.Параметры[2].Выражение = Новый ВыражениеСхемыЗапроса("Авто");
		
		ИмяПараметра = "Сценарий"+?(НомерСтроки=0,"Эталон",НомерСтроки);
		ДобавитьПараметр(ИмяПараметра,СтрокаСценария.Сценарий);
		ИсточникОбороты.Источник.Параметры[3].Выражение = Новый ВыражениеСхемыЗапроса("Сценарий = &"+ИмяПараметра+" {(Сценарий=&"+ИмяПараметра+")}");             //{(Сценарий = &Сценарий0)}
		
		// измерения
		ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".Сценарий","Сценарий");
		ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".СтатьяОборотов","СтатьяОборотов");
		ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".Контрагент","Контрагент");
		ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".Номенклатура","Номенклатура");
		//ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".ПериодДень","День");
		//ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".ПериодМесяц","Месяц");
		//ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".ПериодКвартал","Квартал");
		//ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".ПериодГод","Год");
		ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".Регистратор","Документ");
		
		// Ресурсы
		ИндексНачальногоПоляРесурсов = ОператорВыборка.ВыбираемыеПоля.Количество();
		Если НомерСтроки = 0 Тогда
			ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(IsNull("+ПсевдонимТаблицы+".СуммаУпрОборот,0))","СуммаЭталон");
			ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(IsNull("+ПсевдонимТаблицы+".КоличествоОборот,0))","КоличествоЭталон");
			// добавим нулевые поля для объединения со следующими таблицами запроса
			Для Сч = 1 По КоличествоСтрокАнализа - 1 Цикл
				ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(0)","СуммаПериода"+Сч);
				ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(0)","КоличествоПериода"+Сч);
			КонецЦикла;
			
		Иначе
			ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(0)","СуммаЭталон");
			ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(0)","КоличествоЭталон");
			
			Для СЧ = 1 По КоличествоСтрокАнализа-1 Цикл
				Если Сч = НомерСтроки Тогда
					// добавляем без псевдонимов дабы не конфкликтовать с существующими полями
					ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(IsNull("+ПсевдонимТаблицы+".СуммаУпрОборот,0))","");
					ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(IsNull("+ПсевдонимТаблицы+".КоличествоОборот,0))","");
				Иначе
					ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(0)","");
					ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(0)","");
				Конецесли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	// установка соответсвий полей запроса в объединении
	// нам нужно чтобы автоматом поля ресурсов не ложились друг на друга
	
	Для НомерКолонки = ИндексНачальногоПоляРесурсов По СхемаЗапроса.ПакетЗапросов[0].Колонки.Количество()-1 Цикл
		Для НомерСтроки  = 0 По КоличествоСтрокАнализа - 1 Цикл
			СхемаЗапроса.ПакетЗапросов[0].Колонки[НомерКолонки].Поля[НомерСтроки] = СхемаЗапроса.ПакетЗапросов[0].Операторы[НомерСтроки].ВыбираемыеПоля[НомерКолонки];
		КонецЦикла;
	КонецЦикла;	
	
	СхемаЗапроса.ПакетЗапросов.Добавить();
	ПакетЗапроса   = СхемаЗапроса.ПакетЗапросов[1];  // Второй павкет запроса из временной таблицы
	
	ОператорВыборка = ПакетЗапроса.Операторы[0];
	ПсевдонимТаблицы = "ОборотыБюджета";
	ИсточникОбороты = ОператорВыборка.Источники.Добавить("ВР_ОБОРОТЫ",ПсевдонимТаблицы); // таблица из которой будем выбирать
	// измерения
	ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".Сценарий","Сценарий");
	ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".СтатьяОборотов","СтатьяОборотов");
	ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".Контрагент","Контрагент");
	ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".Номенклатура","Номенклатура");
	//ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".День","День");
	//ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".Месяц","Месяц");
	//ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".Квартал","Квартал");
	//ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".Год","Год");
	ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,ПсевдонимТаблицы+".Документ","Документ");
	
	// Ресурсы
	Для НомерКолонки = ИндексНачальногоПоляРесурсов По СхемаЗапроса.ПакетЗапросов[0].Колонки.Количество()-1 Цикл
		ПсевдонимКолонки = СхемаЗапроса.ПакетЗапросов[0].Колонки[НомерКолонки].Псевдоним;
		ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма("+ПсевдонимКолонки+")",ПсевдонимКолонки);	
	КонецЦикла;	
	
	ПсевдонимКолонкиСуммаЭталон 		= СхемаЗапроса.ПакетЗапросов[0].Колонки[ИндексНачальногоПоляРесурсов].Псевдоним;
	ПсевдонимКолонкиКоличествоЭталон 	= СхемаЗапроса.ПакетЗапросов[0].Колонки[ИндексНачальногоПоляРесурсов+1].Псевдоним;
	
	Для Сч = 1 По КоличествоСтрокАнализа-1 Цикл
		ПсевдонимКолонки			= ПсевдонимТаблицы + ".СуммаПериода"+Сч;
		ПсевдонимКолонкиОтклонения	= "ОтклонениеСумма"+Сч;
		ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(isNull("+ПсевдонимТаблицы+".СуммаЭталон"+",0)-IsNull("+ПсевдонимКолонки+",0))",ПсевдонимКолонкиОтклонения);	
		
		ПсевдонимКолонки			= ПсевдонимТаблицы + ".КоличествоПериода"+Сч;
		ПсевдонимКолонкиОтклонения	= "ОтклонениеКоличество"+Сч;
		ДобавитьПолеЗапроса(ПакетЗапроса,ОператорВыборка,"Сумма(isNull("+ПсевдонимТаблицы+".КоличествоЭталон"+",0)-IsNull("+ПсевдонимКолонки+",0))",ПсевдонимКолонкиОтклонения);	
	КонецЦикла;
	
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматПоляСКД(Поле,Формат)
	Формат = Поле.Оформление.Элементы.Найти("Формат");
	Формат.Использование = Истина;
	Формат.Значение = "ЧЦ=15; ЧДЦ=2; ЧН=-";
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолеСКД(НаборДанных,ИмяПоля,ФорматнаяСтрока="",НеИспользоватьВУсловиях,НеИспользоватьРеквизиты=Истина)
	НовоеПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПоле.Поле = ИмяПоля;
	НовоеПоле.ПутьКДанным= ИмяПоля;
	НовоеПоле.ОграничениеИспользования.Условие=НеИспользоватьВУсловиях;
	НовоеПоле.ОграничениеИспользованияРеквизитов.Условие=НеИспользоватьРеквизиты;
	Если ЗначениеЗаполнено(ФорматнаяСтрока) Тогда
		УстановитьФорматПоляСКД(НовоеПоле,ФорматнаяСтрока);
	Конецесли;
КонецПроцедуры

&НаСервере
Процедура СобратьСКД()
	
	ТаблицаСценарии = Отчет.ТаблицаСценарии.Выгрузить();
	КоличествоСтрокАнализа = ТаблицаСценарии.Количество();
	
	// инициализирует новую СКД и помещает во временное хранилище
	// устанавливает адрес временного хранилища схемы компоновки данных
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ЛокальнаяБаза";
	ИсточникДанных.СтрокаСоединения = "";
	ИсточникДанных.ТипИсточникаДанных= "Local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "Запрос";
	НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
	НаборДанных.АвтоЗаполнениеДоступныхПолей=Истина;
	НаборДанных.Запрос = ТекстЗапроса;
	//****
	ДобавитьПолеСКД(НаборДанных,"СуммаЭталон","ЧЦ=15; ЧДЦ=2; ЧН=-",Истина);
	ДобавитьПолеСКД(НаборДанных,"КоличествоЭталон","ЧЦ=15; ЧДЦ=3; ЧН=-",Истина);
	//****
	
	
	// принудительно добиваем поля чтобы установить им ограничение использования
	ДобавитьПолеСКД(НаборДанных,"Валюта","",Истина);
	ДобавитьПолеСКД(НаборДанных,"ЦФО","",Истина);
	ДобавитьПолеСКД(НаборДанных,"Проект","",Истина);
	ДобавитьПолеСКД(НаборДанных,"ТЕСТ","",Истина);

	// дорабатываем СКД
	СхемаКомпоновкиДанных.ПоляИтога.Очистить();
	
	НовыйРесурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	НовыйРесурс.ПутьКДанным = "СуммаЭталон";
	НовыйРесурс.Выражение   = "Сумма(СуммаЭталон)";
	
	НовыйРесурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	НовыйРесурс.ПутьКДанным = "КоличествоЭталон";
	НовыйРесурс.Выражение   = "Сумма(КоличествоЭталон)";
	
	Для СЧ = 1 По КоличествоСтрокАнализа - 1 Цикл
		НовыйРесурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
		НовыйРесурс.ПутьКДанным = "СуммаПериода"+Сч;
		НовыйРесурс.Выражение   = "Сумма(СуммаПериода"+Сч+")";
		ДобавитьПолеСКД(НаборДанных,"СуммаПериода"+Сч,"ЧЦ=15; ЧДЦ=2; ЧН=-",Истина);
		
		НовыйРесурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
		НовыйРесурс.ПутьКДанным = "КоличествоПериода"+Сч;
		НовыйРесурс.Выражение   = "Сумма(КоличествоПериода"+Сч+")";
		ДобавитьПолеСКД(НаборДанных,"КоличествоПериода"+Сч,"ЧЦ=15; ЧДЦ=3; ЧН=-",Истина);
		
		НовыйРесурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
		НовыйРесурс.ПутьКДанным = "ОтклонениеСумма"+Сч;
		НовыйРесурс.Выражение   = "Сумма(ОтклонениеСумма"+Сч+")";
		ДобавитьПолеСКД(НаборДанных,"ОтклонениеСумма"+Сч,"ЧЦ=15; ЧДЦ=2; ЧН=-",Истина);
		
		НовыйРесурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
		НовыйРесурс.ПутьКДанным = "ОтклонениеКоличество"+Сч;
		НовыйРесурс.Выражение   = "Сумма(ОтклонениеКоличество"+Сч+")";
		ДобавитьПолеСКД(НаборДанных,"ОтклонениеКоличество"+Сч,"ЧЦ=15; ЧДЦ=3; ЧН=-",Истина);
	КонецЦикла;
	
	СхемаКомпоновкиДанных.Параметры.Очистить();
	
	Для Каждого Стр Из СтруктураПараметров Цикл
		ПараметрДанных               = СхемаКомпоновкиДанных.Параметры.Добавить();
		ПараметрДанных.Имя           = Стр.Ключ;
		ПараметрДанных.Значение		 = Стр.Значение;
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(Стр.Значение));
		ПараметрДанных.ТипЗначения   = Новый ОписаниеТипов(МассивТипов);
		ПараметрДанных.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		ПараметрДанных.Заголовок     = Стр.Ключ;//"Начало периода";
		ПараметрДанных.ВключатьВДоступныеПоля = Ложь;
	КонецЦикла;	
	
	
	СтруктураОтчета = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Структура;
	СтруктураОтчета.Очистить();
	
	// Закладка Настройки другие настройки
	ПараметрГоризонтальноеРасположениеОбщихИтогов = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыВывода.Элементы.Найти("ГоризонтальноеРасположениеОбщихИтогов");
	ПараметрГоризонтальноеРасположениеОбщихИтогов.Значение = РасположениеИтоговКомпоновкиДанных.Нет;
	ПараметрГоризонтальноеРасположениеОбщихИтогов.Использование = Истина;
	
	ПараметрВертикальноеРасположениеОбщихИтогов = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов");
	ПараметрВертикальноеРасположениеОбщихИтогов.Значение = РасположениеИтоговКомпоновкиДанных.Нет;
	ПараметрВертикальноеРасположениеОбщихИтогов.Использование=Истина;
	
	ПараметрВыводитьПараметры = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыВывода.Элементы.Найти("ВыводитьПараметрыДанных");
	ПараметрВыводитьПараметры.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
	ПараметрВыводитьПараметры.Использование=Истина;
	
	// СТРОИМ СТРУКТУРУ ОТЧЕТА
	// группировка строк 
	ГруппировкаСтрок  = СтруктураОтчета.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаСтрок.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ПолеГруппировки = ГруппировкаСтрок.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("СтатьяОборотов");
	ПолеГруппировки.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.Иерархия;
	// ложим схему в хранилище чтобы инициализировать компоновщик
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	ИнициализироватьКомпоновщикСервер(Неопределено);
	Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	
	//ВЫБРАННЫЕ ПОЛЯ
	// Оформляем выбранные поля с группами для лучшего восприятия
	Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	// 1. Точно знаем что есть эталонный "период"
	ГруппаПолей =  Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
	ГруппаПолей.Заголовок = СформироватьЗаголовокГруппыПолей(ТаблицаСценарии[0],"");//"Эталон " + Символы.ПС);
	
	Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы.Найти("СуммаЭталон");
	НовоеПоле = ГруппаПолей.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Заголовок = "Сумма";
	НовоеПоле.Поле = Поле.Поле;
	НовоеПоле.Использование = Истина;
	
	Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы.Найти("КоличествоЭталон");
	НовоеПоле = ГруппаПолей.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПоле.Заголовок = "Количество";
	НовоеПоле.Поле = Поле.Поле;
	НовоеПоле.Использование = Истина;
	
	//2. по каждой строке анализируемых периодов
	Для Сч = 1 По КоличествоСтрокАнализа - 1 Цикл
		ГруппаПолей =  Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		ГруппаПолей.Заголовок = СформироватьЗаголовокГруппыПолей(ТаблицаСценарии[Сч]);
		
		Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы.Найти("СуммаПериода"+Сч);
		НовоеПоле = ГруппаПолей.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок = "Сумма";
		НовоеПоле.Поле = Поле.Поле;
		НовоеПоле.Использование = Истина;
		
		Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы.Найти("КоличествоПериода"+Сч);
		НовоеПоле = ГруппаПолей.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок = "Количество";
		НовоеПоле.Поле = Поле.Поле;
		НовоеПоле.Использование = Истина;
		// отклонения в отдельной группе
		ГруппаПолейОтк =  ГруппаПолей.Элементы.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		ГруппаПолейОтк.Заголовок = "Отклонение";

		Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы.Найти("ОтклонениеСумма"+Сч);
		НовоеПоле = ГруппаПолейОтк.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок = "Сумма";
		НовоеПоле.Поле = Поле.Поле;
		НовоеПоле.Использование = Истина;
		
		Поле = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы.Найти("ОтклонениеКоличество"+Сч);
		НовоеПоле = ГруппаПолейОтк.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок = "Количество";
		НовоеПоле.Поле = Поле.Поле;
		НовоеПоле.Использование = Истина;
	КонецЦикла;	
	
	////// добавляем все поля в выбранные поля (в данном случае этого нам не нужно) закоментировал
	////Для Каждого ДоступноеПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
	////	Если ДоступноеПоле.Папка Тогда
	////		ПродолжитЬ;
	////	КонецЕсли;	
	////	Если ПолеЕстьВКоллекции(КомпоновщикНастроек.Настройки.Выбор.Элементы,ДоступноеПоле.Поле) Тогда
	////		ПродолжитЬ;	
	////	КонецЕсли;
	////	
	////	НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	////	НовоеПоле.Заголовок = ДоступноеПоле.Заголовок;
	////	НовоеПоле.Поле = ДоступноеПоле.Поле;
	////	НовоеПоле.Использование = Истина;
	////КонецЦикла;
	
	Для Каждого Параметр Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Параметр.Использование=Истина;	
	КонецЦикла;
	
	Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	НовыйЭлементОтбора =  Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.ВИерархии;
	НовыйЭлементОтбора.Использование = Ложь;
	НовыйЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СтатьяОборотов");
	// ложим СКД во временное хранилище
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСКД(Команда)
	ОткрытьКонструкторСхемыКомпоновкиДанных();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторСхемыКомпоновкиДанных()
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		// Настройки компоновщика настроек помещаются в редактируемую схему
		ПоместитьНастройкиВСхемуКомпоновкиДанных(Отчет.КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
		
		// Создается копия редактируемой схемы
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных)));
		
		// Копия редактируемой схемы открывается в конструкторе
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Конструктор.Редактировать(ЭтаФорма);
		
	#Иначе
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Для того, чтобы редактировать схему компоновки, необходимо запустить конфигурацию в режиме толстого клиента.'"));
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных)
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	КомпоновкаДанныхКлиентСервер.ОчиститьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновкаДанныхКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных.НастройкиПоУмолчанию, КомпоновщикНастроек.Настройки);
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикСервер(НастройкаКомпоновки)
	Если Не ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда
		ПолучитьСхемуКомпоновкиДанных();
	КонецЕсли;
	
	Попытка
		Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
					УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
	Если НастройкаКомпоновки = Неопределено Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкаКомпоновки);
		Отчет.КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСхемуКомпоновкиДанных()
	// инициализирует новую СКД и помещает во временное хранилище
	// устанавливает адрес временного хранилища схемы компоновки данных
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ЛокальнаяБаза";
	ИсточникДанных.СтрокаСоединения = "";
	ИсточникДанных.ТипИсточникаДанных= "Local";
	
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "Запрос";
	НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
	НаборДанных.АвтоЗаполнениеДоступныхПолей=Истина;
	
	НаборДанных.Запрос = ТекстЗапроса;
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Функция ПолеЕстьВКоллекции(Коллекция,Поле)
	Для Каждого Элемент Из Коллекция Цикл
		Если Элемент.Поле = Поле Тогда
			Возврат Истина;	
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АдресСхемы") Тогда
		СКД = ПолучитьИзВременногоХранилища(Параметры.АдресСхемы);
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СКД,УникальныйИдентификатор);
		Отчет.АдресСхемы = АдресСхемыКомпоновкиДанных;
	КонецЕсли;
	
	Если Параметры.Свойство("Расшифровка") Тогда
		Если Параметры.Расшифровка <> Неопределено Тогда
			Если ТипЗнч(Параметры.Расшифровка) = Тип("ОписаниеОбработкиРасшифровкиКомпоновкиДанных") Тогда
				ДР = ПолучитьИзВременногоХранилища(Параметры.Расшифровка.Данные);
				ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДР,УникальныйИдентификатор);	
				ПодготовитьКомпановщик();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ТаблицаСценарии") Тогда
		Отчет.ТаблицаСценарии.Очистить();
		Для Каждого Стр Из Параметры.ТаблицаСценарии Цикл
			НоваяСтрока = Отчет.ТаблицаСценарии.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
		КонецЦИкла;
	Конецесли;
	
	Если Отчет.ТаблицаСценарии.Количество() = 0 Тогда
		НоваяСтрока = Отчет.ТаблицаСценарии.Добавить();
		НоваяСтрока.ВидДанных = Перечисления.ВидыДанныхДляОтчетовБюджетирования.Сценарий;
		НоваяСтрока.Сценарий = Справочники.СценарииПланирования.ОсновнойСценарийПанирования;
	КонецЕсли;
	
	ЭтоРасшифровка=	Параметры.СформироватьПриОткрытии;//	СформироватьПриОткрытии = Истина;
	Параметры.СформироватьПриОткрытии=Ложь;
	//	ИнициализироватьКомпоновщикСервер(Неопределено);
КонецПроцедуры


&НаСервере
Процедура ПодготовитьКомпановщик()
	Отчет.АдресСхемы = АдресСхемыКомпоновкиДанных;
	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
	ПодготовитьКомпановщик();
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);
	Элементы.Страницы.ТекущаяСтраница=Элементы.СтраницаОтчет;
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьЗапросВСхемуЗапросаНаСервере()
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
КонецПроцедуры


//****** РАСШИФРОВКА

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	//СтандартнаяОбработка=Ложь;
	//ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет.АдресСхемы));	
	//ВыполненноеДействие = Неопределено;
	//
	//
	//ВыполненноеДействие = Неопределено;
	//Настройки = Неопределено;
	//ДополнительныеДействия = Неопределено;
	//
	//ОбработкаРасшифровки.ВыбратьДействие(Расшифровка,ВыполненноеДействие,Настройки,	,ДополнительныеДействия,);
	//
	////Настройки = ОбработкаРасшифровки.Выполнить(Расшифровка);// такой вариант работает только в толстом клиенте
	//Если Настройки<>Неопределено Тогда
	//	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
	//	//	ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка,Настройки);
	//	//	ИнициализироватьКомпоновщикСервер(Настройки);
	//		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	//		СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);
	//	Конецесли;
	//КонецЕсли;
	//
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтоРасшифровка Тогда
		ПодготовитьКомпановщик();	
		Сформировать(Неопределено);
	Иначе
		ИнициализироватьОтчет();
	КОнецесли;
КонецПроцедуры


&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ПериодОтчета.ДатаНачала) и ЗначениеЗаполнено(ПериодОтчета.ДатаОкончания) Тогда
		Если Отчет.ТаблицаСценарии.Количество() > 0 Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ПериодОтчетаПриИзмененииЗавершение", ЭтаФорма), "Установить период в таблице сценариев?",РежимДиалогаВопрос.ДаНет);	
		КонецЕслИ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Для Каждого Стр Из Отчет.ТаблицаСценарии Цикл
			Стр.НачалоПериода = ПериодОтчета.ДатаНачала;
			СТр.КонецПериода = ПериодОтчета.ДатаОкончания;
		КонецЦикла;	
		ИнициализироватьОтчет();
	КонецЕсли;
	
КонецПроцедуры
